Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To disable the default JSON behavior, set `quarkus.resteasy-json.default-json=false`, and the default will return to auto-negotiation. In this case, you must include `@Produces(MediaType.APPLICATION_JSON)` and `@Consumes(MediaType.APPLICATION_JSON)` annotations in your endpoints to use JSON.
ja_jp: デフォルトの JSON 動作を無効にするには、`quarkus.resteasy-json.default-json=false` を設定します。デフォルトが自動ネゴシエーションに戻ります。 この場合、JSON を使用するには、エンドポイントに `@Produces(MediaType.APPLICATION_JSON)` および `@Consumes(MediaType.APPLICATION_JSON)` アノテーションを含める必要があります。

source: To disable the gRPC client metrics when `quarkus-micrometer` is used, add the following property to the application configuration:
ja_jp: `quarkus-micrometer` を使用しているときに gRPC クライアントメトリクスを無効にするには、アプリケーションの設定に以下のプロパティを追加します。

source: To disable the gRPC server metrics when `quarkus-micrometer` is used, add the following property to the application configuration:
ja_jp: `quarkus-micrometer` を使用しているときに gRPC サーバーメトリクスを無効にするには、アプリケーションの設定に以下のプロパティを追加します。

source: To disable the reactive datasource explicitly:
ja_jp: リアクティブデータソースを明示的に無効にするには、次のようにします:

source: To do it, first define the 2 following properties in the `<properties>` section:
ja_jp: そのためには、まず `<properties>` セクションで以下の 2 つのプロパティーを定義します。

source: To do so, it suffices to add the link:{runonvthread}[@RunOnVirtualThread] annotation to the endpoint. If the JDK is compatible (Java 19 or later versions) then the endpoint will be offloaded to a virtual thread. It will then be possible to perform blocking operations without blocking the platform thread upon which the virtual thread is mounted.
ja_jp: そのためには、エンドポイントに link:{runonvthread}[@RunOnVirtualThread] アノテーションを追加すれば十分です。JDKに互換性がある場合（Java 19またはそれ以降のバージョン）はエンドポイントは仮想スレッドにオフロードされます。この場合は仮想スレッドがマウントされているプラットフォームスレッドをブロックせずにブロック操作を実行できるようになります。

source: To do so, it suffices to add the link:{runonvthread}[@RunOnVirtualThread] annotation to the endpoint. If the Java Virtual Machine used to **run** the application provides virtual thread support (so Java 21 or later versions), then the endpoint execution is offloaded to a virtual thread. It will then be possible to perform blocking operations without blocking the platform thread upon which the virtual thread is mounted.
ja_jp: そのためには、エンドポイントに link:{runonvthread}[@RunOnVirtualThread] アノテーションを追加すれば十分です。 アプリケーションの **実行** に使用される Java 仮想マシンが仮想スレッドのサポートを提供している場合 (Java 21 以降のバージョン)、エンドポイントの実行は仮想スレッドにオフロードされます。 これにより、仮想スレッドがマウントされているプラットフォームスレッドをブロックすることなく、ブロッキング処理を実行できるようになります。

source: To do this you can return/produce a `WorkspaceActionBuildItem` in your processor:
ja_jp: これを行うには、プロセッサーで `WorkspaceActionBuildItem` を返すか生成します。

source: To do this you must build a mutable application, using the `mutable-jar` format. Set the following properties in `application.properties`:
ja_jp: そのためには、 `mutable-jar` のフォーマットを使って mutable アプリケーションを構築する必要があります。 `application.properties` で以下のプロパティを設定します。

source: To do this, first re-generate a Quarkus native executable removing debug info, which bcc/eBPF does not understand, and instead use frame pointer with local symbols to get the stack traces:
ja_jp: そのためには、まずQuarkusのネイティブ実行可能ファイルを生成し直し、bcc/eBPFが理解できないデバッグ情報を削除し、代わりにローカルシンボルを含むフレームポインタを使用してスタックトレースを取得します:

source: To do this, define the following properties in the `<properties>` section:
ja_jp: これを行うには、 `<properties>` セクションの以下のプロパティーを定義します。

source: To do this, first create a directory `src/main/zip.native/` with your build. Next create a shell script file called `bootstrap` within `src/main/zip.native/`, like below. An example is create automatically in your build folder (target or build), called `bootstrap-example.sh`
ja_jp: これを行うには、まず、ビルドでディレクトリー `src/main/zip.native/` を作成します。次に `src/main/zip.native/` 内に `bootstrap` という名前のシェルスクリプトファイルを作成します。サンプル `bootstrap-example.sh` がビルドフォルダー(ターゲットまたはビルド)内に自動的に作成されます。

source: To do this, first create a directory `src/main/zip.native/` with your build. Next create a shell script file called `bootstrap` within `src/main/zip.native/`, like below. An example is created automatically in your build folder (target or build), called `bootstrap-example.sh`
ja_jp: これを行うには、まず、ビルドでディレクトリー `src/main/zip.native/` を作成します。次に `src/main/zip.native/` 内に `bootstrap` という名前のシェルスクリプトファイルを作成します。サンプル `bootstrap-example.sh` がビルドフォルダー(ターゲットまたはビルド)内に自動的に作成されます。

source: To do this, produce a `UnlistedPageBuildItem`:
ja_jp: これを行うには、`UnlistedPageBuildItem` を生成します。

source: To do this, we will need to set up JSON serialization with Jackson or JSON-B.
ja_jp: そのためには、Jackson や JSON-B で JSON シリアライゼーションを設定する必要があります。

source: To do this, we will need to setup JSON serialization with Jackson or JSON-B.
ja_jp: そのためには、Jackson や JSON-B で JSON シリアライゼーションを設定する必要があります。

source: To do this, you must provide a Webcomponent that will be loaded in the place of the provided card and register this in the Java Processor:
ja_jp: これを行うには、提供されたカードの代わりに読み込まれる Web コンポーネントを提供し、これを Java プロセッサーに登録する必要があります。

source: To ease the containerization of native executables, Quarkus provides a base image providing the requirements to run these executables.
ja_jp: ネイティブ実行可能ファイルのコンテナ化を容易にするため、Quarkusには、これらの実行可能ファイルを実行するための要件を提供するベースイメージが用意されています。

source: To ease the containerization of native executables, Quarkus provides a base image providing the requirements to run these executables. The `quarkus-micro-image:1.0` image is:
ja_jp: ネイティブ実行可能ファイルのコンテナ化を容易にするために、Quarkusはこれらの実行可能ファイルを実行するための要件を提供するベースイメージを提供しています。 `quarkus-micro-image:1.0` のイメージは:

source: To ease the containerization of native executables, Quarkus provides a base image providing the requirements to run these executables. The `quarkus-micro-image:2.0` image is:
ja_jp: ネイティブ実行可能ファイルのコンテナ化を容易にするために、Quarkusはこれらの実行可能ファイルを実行するための要件を提供するベースイメージを提供しています。 `quarkus-micro-image:1.0` のイメージは次の通りです:

source: To ease the containerization of native executables, Quarkus provides a base image providing the requirements to run these executables. The `ubi9-quarkus-micro-image:2.0` image is:
ja_jp: ネイティブ実行可能ファイルのコンテナ化を容易にするため、Quarkusでは、実行可能ファイルを実行するための要件を提供するベースイメージを用意しています。 `ubi9-quarkus-micro-image:2.0` イメージは以下の特徴を持ちます:

source: To ease the user experience throughout this guide, it is better to have the Azure CLI installed and authenticated.
ja_jp: このガイド全体を通してユーザー体験を容易にするために、Azure CLI をインストールして認証した方が良いでしょう。

source: To edit the JBang script in an IDE/editor with content assist you can run `jbang edit quarkusapp.java` or `jbang edit quarkusapp.java`.
ja_jp: JBangスクリプトをコンテンツアシストのあるIDE/エディタで編集するには、 `jbang edit quarkusapp.java` または `jbang edit quarkusapp.java` を実行します。

source: To effectively integrate the reactive logic with the REST API, your application needs to declare a dependency to the Quarkus RestEasy Mutiny extension:
ja_jp: リアクティブロジックとREST APIを効果的に統合するには、アプリケーションでQuarkus RestEasy Mutinyエクステンションへの依存関係を宣言する必要があります：

source: To enable HTTP headers to be sent on every response, add the following properties:
ja_jp: すべてのレスポンスに HTTP ヘッダーを送信するようにするには、以下のプロパティーを追加します。

source: To enable JFR on native executables, it is usually built with `--enable-monitoring`. However, we can enable JFR in Quarkus native executables by adding `jfr` to the configuration property `quarkus.native.monitoring`. There are two ways to set up this configuration: by including it in the `application.properties` or by specifying it at build time.
ja_jp: ネイティブ実行可能ファイルで JFR を有効化するには、通常、 `--enable-monitoring` を使用してビルドします。 ただし、設定プロパティー `quarkus.native.monitoring` に `jfr` を追加することで、Quarkus ネイティブ実行可能ファイルで JFR を有効化できます。 この設定をセットアップするには、 `application.properties` に含めるか、ビルド時に指定するかの 2 つの方法があります。

source: To enable Micrometer metrics in your application, you need to add the following to your pom.xml.
ja_jp: アプリケーションで Micrometer メトリクスを有効にするには、pom.xml に以下を追加する必要があります。

source: To enable SNI:
ja_jp: SNI を有効にするには、次のように指定します。

source: To enable SSL support with native executables, please refer to our xref:native-and-ssl.adoc[Using SSL With Native Executables guide].
ja_jp: ネイティブ実行可能ファイルで SSL サポートを有効にするには、 xref:native-and-ssl.adoc[ネイティブ実行可能ファイルでの SSL 利用ガイド]を参照してください。

source: To enable Service Binding for supported extensions, add the `quarkus-kubernetes-service-binding` extension to the application dependencies.
ja_jp: サポートされるエクステンションの Service Binding を有効にするには、`quarkus-kubernetes-service-binding` エクステンションをアプリケーションの依存関係に追加します。

source: To enable Service Binding support, in addition to one of the currently supported extensions, the `quarkus-kubernetes-service-binding` extension needs to be added to the application dependencies.
ja_jp: サービスバインディングのサポートを有効にするには、現在サポートされているエクステンションの1つに加えて、アプリケーションの依存関係に `quarkus-kubernetes-service-binding` エクステンションを追加する必要があります。

source: To enable TLS, use the following configuration.
ja_jp: TLSを有効にするには、以下の設定を使用します。

source: To enable TLS, use the following configuration. Note that all paths in the configuration may either specify a resource on the classpath (typically from `src/main/resources` or its subfolder) or an external file.
ja_jp: TLS を有効にするには、以下の設定を使用します。構成内のすべてのパスは、クラスパス上のリソース (通常は `src/main/resources` またはそのサブフォルダーから) または外部ファイルのいずれかを指定することに注意してください。

source: To enable TLS/SSL support with native executables, please refer to our xref:native-and-ssl.adoc[Using SSL With Native Executables guide].
ja_jp: ネイティブ実行可能ファイルでの TLS/SSL サポートを有効にするには、 xref:native-and-ssl.adoc[ネイティブ実行可能ファイルでの SSL の使用ガイド] を参照してください。

source: To enable Web Links support, add the `quarkus-rest-links` extension to your project.
ja_jp: Web リンクのサポートを有効にするには、プロジェクトに `quarkus-rest-links` エクステンションを追加します。

source: To enable Web Links support, add the `quarkus-resteasy-reactive-links` extension to your project.
ja_jp: Web リンクのサポートを有効にするには、プロジェクトに `quarkus-resteasy-reactive-links` エクステンションを追加します。

source: To enable XML support, add the `quarkus-rest-jaxb` extension to your project.
ja_jp: XML サポートを有効にするには、プロジェクトに `quarkus-rest-jaxb` エクステンションを追加します。

source: To enable XML support, add the `quarkus-resteasy-reactive-jaxb` extension to your project.
ja_jp: XML サポートを有効にするには、プロジェクトに `quarkus-resteasy-reactive-jaxb` エクステンションを追加します。

source: To enable YAML configuration, add the `quarkus-config-yaml` extension:
ja_jp: YAML設定を有効にするには、 `quarkus-config-yaml` エクステンションを追加します。

source: To enable an authorization code flow authentication, the `quarkus.oidc.application-type` property must be set to `web-app`. Usually, the Quarkus OIDC `web-app` application type must be set when your Quarkus application is a frontend application that serves HTML pages and requires an OIDC single sign-on login. For the Quarkus OIDC `web-app` application, the authorization code flow is the preferred method for user authentication.
ja_jp: 認可コードフロー認証を有効にするには、 `quarkus.oidc.application-type` プロパティーを `web-app` に設定する必要があります。 通常、Quarkus アプリケーションが HTML ページを提供し、OIDC シングルサインオンログインを必要とするフロントエンドアプリケーションである場合に、Quarkus OIDC の `web-app` アプリケーションタイプを設定する必要があります。 Quarkus OIDC の `web-app` アプリケーションでは、認可コードフローがユーザー認証の優先メソッドとなります。

source: To enable an authorization code flow authentication, the `quarkus.oidc.application-type` property must be set to `web-app`. Usually, the Quarkus OIDC `web-app` application type must be set when your Quarkus application is a frontend application which serves HTML pages and requires an OIDC single sign-on login. For the Quarkus OIDC `web-app` application, the authorization code flow is defined as the preferred method for authenticating users. When your application serves HTML pages and provides REST API at the same time, and requires both the authorization code flow authentication and xref:security-oidc-bearer-token-authentication.adoc[the bearer access token authentication], the `quarkus.oidc.application-type` property can be set to `hybrid` instead. In this case, the authorization code flow is only triggered when an HTTP `Authorization` request header with a `Bearer` authorization scheme containing a bearer access token is not set.
ja_jp: 認証コードフロー認証を有効にするには、 `quarkus.oidc.application-type` プロパティを `web-app` に設定する必要があります。 通常、Quarkus OIDC `web-app` アプリケーションタイプは、Quarkus アプリケーションが HTML ページを提供するフロントエンドアプリケーションで、OIDC シングルサインオンログインが必要な場合に設定する必要があります。 Quarkus OIDC `web-app` アプリケーションでは、認可コードフローがユーザー認証の優先方法として定義されています。 アプリケーションが HTML ページを提供すると同時に REST API を提供し、認証コードフロー認証と xref:security-oidc-bearer-token-authentication.adoc[ベアラアクセストークン認証]の 両方が必要な場合、代わりに `quarkus.oidc.application-type` プロパティを `hybrid` に設定できます。この場合、ベアラ・アクセストークンを含む `Bearer` 認証スキームを持つ HTTP `Authorization` リクエスト・ヘッダが設定されていない場合にのみ、認可コード・フローがトリガされます。

source: To enable authentication for the embedded realm, set the `quarkus.security.users.embedded.enabled` property to `true`.
ja_jp: 埋め込みレルムの認証を有効にするには、`quarkus.security.users.embedded.enabled` プロパティーを `true` に設定します。

source: To enable authentication for this SPA Keycloak example, disable *Client authentication* and set *Web origins* to `http://localhost:8080`. These settings allow Keycloak's CORS policy to communicate with your Quarkus application. The code provides an example of building Quarkus single-page applications integrated with Keycloak. For more details about creating single-page applications integrating Keycloak, refer to the official link:https://www.keycloak.org/securing-apps/javascript-adapter[Keycloak JavaScript adapter documentation].
ja_jp: この SPA Keycloak の例で認証を有効にするには、 *クライアント認証* を無効にし、 *Web origins* を次のように設定します。 `http://localhost:8080` .これらの設定により、KeycloakのCORSポリシーがQuarkusアプリケーションと通信できるようになります。このコードでは、Keycloakと統合されたQuarkusのシングルページアプリケーションを構築する例を示します。Keycloakを統合したシングルページアプリケーションの作成の詳細については、 link:https://www.keycloak.org/securing-apps/javascript-adapter[Keycloak JavaScriptアダプター]の 公式 link:https://www.keycloak.org/securing-apps/javascript-adapter[ドキュメント]を 参照してください。

source: To enable basic authentication set `quarkus.http.auth.basic=true`. You must also have at least one extension installed that provides a username/password based `IdentityProvider`, such as xref:security-jdbc.adoc[Elytron JDBC].
ja_jp: 基本認証を有効にするには、 `quarkus.http.auth.basic=true` を設定します。また、 xref:security-jdbc.adoc[Elytron JDBC] のような、ユーザ名/パスワードベースの `IdentityProvider` を提供するエクステンションを少なくとも 1 つインストールしておく必要があります。

source: To enable client xDS, use the following configuration.
ja_jp: クライアントxDSを有効にするには、次の設定を使用します。

source: To enable gRPC code generation, add the following dependency to your project:
ja_jp: gRPC コード生成を有効化するには、プロジェクトに以下の依存関係を追加します。

source: To enable gRPC, add the following dependency to your project:
ja_jp: gRPC を有効にするには、プロジェクトに次の依存関係を追加します。

source: To enable internal metrics collection explicitly for the default data source, set `quarkus.datasource.jdbc.metrics.enabled=true`. To enable internal metrics collection explicitly for a named data source, set `quarkus.datasource.<datasource name>.jdbc.metrics.enabled=true`. This enables internal metrics collection even when you do not add a metrics extension. You can access the collected metrics programmatically by calling `dataSource.getMetrics()` on an injected `AgroalDataSource` instance.
ja_jp: デフォルトデータソースに対して明示的に内部メトリクス収集を有効にするには、 `quarkus.datasource.jdbc.metrics.enabled=true` を設定します。 名前付きデータソースに対して明示的に内部メトリクス収集を有効にするには、 `quarkus.datasource.<datasource name>.jdbc.metrics.enabled=true` を設定します。 これにより、メトリクスエクステンションを追加していない場合でも内部メトリクス収集が有効になります。 注入された `AgroalDataSource` インスタンスで `dataSource.getMetrics()` を呼び出すことで、収集されたメトリクスにプログラムでアクセスできます。

source: To enable it, add the following dependency to your build file:
ja_jp: これを有効にするには、ビルドファイルに以下の依存関係を追加します:

source: To enable logging for `@QuarkusTest`, it is necessary to set the `java.util.logging.manager` system property to `org.jboss.logmanager.LogManager` early in the startup process, or logging will not work as expected.
ja_jp: `@QuarkusTest` でロギングを有効にするには、起動プロセスの早い段階で `java.util.logging.manager` システムプロパティーを `org.jboss.logmanager.LogManager` に設定する必要があります。そうしないと、ロギングが期待通りに動作しません。

source: To enable metrics for programmatically created REST Clients, the following snippet can be used:
ja_jp: プログラムで作成された REST クライアントのメトリクスを有効にするには、次のスニペットを使用できます。

source: To enable offline startup, set the following configuration property:
ja_jp: オフライン起動を有効にするには、以下の設定プロパティーを設定します。

source: To enable second-level cache, mark the entities that you want cached with `@jakarta.persistence.Cacheable`:
ja_jp: セカンドレベルキャッシュを有効にするには、キャッシュさせたいエンティティを `@jakarta.persistence.Cacheable` でマークします:

source: To enable second-level cache, mark the entities that you want cached with `@javax.persistence.Cacheable`:
ja_jp: 第 2 レベルのキャッシュを有効にするには、キャッシュしたいエンティティーを `@javax.persistence.Cacheable` でマークします。

source: To enable server xDS, use the following configuration.
ja_jp: サーバーxDSを有効にするには、次の設定を使用します。

source: To enable the Dev Assistant in your Quarkus project, add the `quarkus-chappie` extension:
ja_jp: Quarkus プロジェクトで Dev Assistant を有効にするには、 `quarkus-chappie` エクステンションを追加します:

source: To enable the HAL support, add the `quarkus-hal` extension to your project. Also, as HAL needs JSON support, you need to add either the `quarkus-rest-jsonb` or the `quarkus-rest-jackson` extension.
ja_jp: HAL のサポートを有効にするには、 `quarkus-hal` エクステンションをプロジェクトに追加します。また、 HAL は JSON サポートを必要とするため、 `quarkus-rest-jsonb` または `quarkus-rest-jackson` のいずれかのエクステンションモジュールを追加する必要があります。

source: To enable the HAL support, add the `quarkus-hal` extension to your project. Also, as HAL needs JSON support, you need to add either the `quarkus-resteasy-jsonb` or the `quarkus-resteasy-jackson` extension.
ja_jp: HAL のサポートを有効にするには、 `quarkus-hal` エクステンションをプロジェクトに追加します。また、 HAL は JSON サポートを必要とするため、 `quarkus-resteasy-jsonb` または `quarkus-resteasy-jackson` のいずれかのエクステンションモジュールを追加する必要があります。

source: To enable the HAL support, add the `quarkus-hal` extension to your project. Also, as HAL needs JSON support, you need to add either the `quarkus-resteasy-reactive-jsonb` or the `quarkus-resteasy-reactive-jackson` extension.
ja_jp: HAL サポートを有効にするには、プロジェクトに `quarkus-hal` エクステンションを追加します。また、HAL には JSON サポートが必要なため、 `quarkus-resteasy-reactive-jsonb` または `quarkus-resteasy-reactive-jackson` エクステンションを追加する必要があります。

source: To enable the Quarkus OIDC extension at runtime, set `quarkus.oidc.tenant-enabled=false` at build time. Then, re-enable it at runtime by using a system property.
ja_jp: 実行時に Quarkus OIDC エクステンションを有効にするには、ビルド時に `quarkus.oidc.tenant-enabled=false` を設定します。 続いて、システムプロパティーを使用して実行時に再度有効にします。

source: To enable the `outbox-polling` coordination strategy, an additional extension is required:
ja_jp: `outbox-polling` 調整ストラテジーを有効にするには、追加のエクステンションが必要です:

source: To enable the alternative DNS resolver, use:
ja_jp: 代替のDNSリゾルバを有効にするには

source: To enable the cache, set `quarkus.security.ldap.cache.enabled=true` in your configuration file.
ja_jp: キャッシュを有効にするには、設定ファイルで `quarkus.security.ldap.cache.enabled=true` を設定してください。

source: To enable the generation of Knative resources, you need to include Knative in the target platforms:
ja_jp: Knative リソースの生成を可能にするには、ターゲットプラットフォームに Knative を含める必要があります。

source: To enable the generation of OpenShift resources, you need to include OpenShift in the target platforms:
ja_jp: OpenShift リソースの生成を有効にするには、ターゲットプラットフォームに OpenShift を含める必要があります。

source: To enable the management interface, use the following **build-time** property:
ja_jp: マネジメントインタフェースを有効にするには、次の *ビルド時* プロパティを使用します:

source: To enable the strict mode, use the following configuration:
ja_jp: ストリクトモードを有効にするには、次のように設定します:

source: To enable the use-case of building and testing a Quarkus application offline, the `quarkus-maven-plugin` includes the `go-offline` goal that could be called from the command line like this:
ja_jp: Quarkus アプリケーションをオフラインでビルドおよびテストするユースケースを有効にするために、 `quarkus-maven-plugin` には、以下のようにコマンドラインから呼び出すことができる `go-offline` ゴールが含まれています。

source: To enable the use-case of building and testing a Quarkus application offline, the plugin includes the `quarkusGoOffline` task that could be called from the command line like this:
ja_jp: オフラインでQuarkusアプリケーションを構築してテストするというユースケースを可能にするために、プラグインには `quarkusGoOffline` タスクが含まれており、コマンドラインから次のように呼び出すことができます。

source: To enable this detection:
ja_jp: この検出を有効にするには

source: To enable this feature, all that needs to be done is set the `enable-local-proxy` configuration option for the configKey corresponding to the client for which proxying is desired. For example:
ja_jp: この機能は、プロキシーが必要なクライアントに対応する configKey の `enable-local-proxy` 設定オプションを設定するだけで有効化できます。 以下に例を示します。

source: To enable this feature, set the <<quarkus-rest-jackson_quarkus-rest-jackson-optimization-enable-reflection-free-serializers,`quarkus.rest.jackson.optimization.enable-reflection-free-serializers`>> configuration property to `true`:
ja_jp: この機能を有効にするには、<<quarkus-rest-jackson_quarkus-rest-jackson-optimization-enable-reflection-free-serializers,`quarkus.rest.jackson.optimization.enable-reflection-free-serializers`>> 設定プロパティーを `true` に設定します。

source: To enable this feature, set the `quarkus.generate-code.grpc.use-arg-file` property in your `application.properties` file to `true`.
ja_jp: この機能を有効にするには、 `application.properties` ファイル内の `quarkus.generate-code.grpc.use-arg-file` プロパティーを `true` に設定します。

source: To enable this feature, the property `quarkus.bootstrap.workspace-discovery` needs to be set to `true` either as a system property when invoking the build tool, either as a build tool property. Setting this property in `application.properties` will **not** work because this property needs to be known very early on in the build process.
ja_jp: この機能を有効にするには、ビルドツール起動時にシステムプロパティとして、またはビルドツールプロパティとして、プロパティ `quarkus.bootstrap.workspace-discovery` を `true` に設定する必要があります。このプロパティは、ビルドプロセスの非常に早い段階で認識される必要があるため、 `application.properties` で設定しても正しく *機能しません* 。

source: To enable this security feature, add this to your `application.properties` file:
ja_jp: このセキュリティー機能を有効にするには、これを `application.properties` ファイルに追加します。

source: To enable traffic shaping, add the following property in your application configuration:
ja_jp: トラフィック・シェーピングを有効にするには、アプリケーション・コンフィグレーションに以下のプロパティを追加する：

source: To enable virtual thread support on a message consumer method, simply add the link:{runonvthread}[@RunOnVirtualThread] annotation to the method. If the JDK is compatible (Java 19 or later versions, we recommend 21+) then each incoming message will be offloaded to a new virtual thread. It will then be possible to perform blocking operations without blocking the platform thread upon which the virtual thread is mounted.
ja_jp: メッセージコンシューマーメソッドで仮想スレッドのサポートを有効にするには、link:{runonvthread}[@RunOnVirtualThread] アノテーションをメソッドに追加します。 JDK に互換性がある場合 (Java 19 以降のバージョン、推奨は 21 以降)、各着信メッセージが新しい仮想スレッドにオフロードされます。 こうすることで、仮想スレッドがマウントされているプラットフォームスレッドをブロックせずに、ブロッキング操作を実行できるようになります。

source: To enable virtual thread support on a service method, simply add the link:{runonvthread}[@RunOnVirtualThread] annotation to the method. If the JDK is compatible (Java 19 or later versions - we recommend 21+) then the invocation will be offloaded to a new virtual thread. It will then be possible to perform blocking operations without blocking the platform thread upon which the virtual thread is mounted.
ja_jp: サービスメソッドで仮想スレッドのサポートを有効にするには、link:{runonvthread}[@RunOnVirtualThread] アノテーションをメソッドに追加します。 JDK に互換性がある場合 (Java 19 以降のバージョン - 推奨は 21 以降)、呼び出しは新しい仮想スレッドにオフロードされます。 こうすることで、仮想スレッドがマウントされているプラットフォームスレッドをブロックせずに、ブロッキング操作を実行できるようになります。

source: To encrypt a token with RSA or EC public keys, it is recommended to sign the token first if a signing key is available. For more information, see the <<innersign-encrypt-claims,Sign the claims and encrypt the nested JWT token>> section.
ja_jp: RSA または EC 公開鍵でトークンを暗号化する場合、署名鍵が利用可能な場合は、まずトークンに署名することを推奨します。詳細は、<<innersign-encrypt-claims,Sign the claims and encrypt the nested JWT token>> セクションを参照してください。

source: To encrypt and later decrypt configuration values, add the following managed dependency:
ja_jp: 設定値を暗号化し、後で復号化するには、以下のマネージド依存関係を追加します：
